{
    "welcome": "Welcome",
    "about": "About",
    "projects": "Projects",
    "contact": "Contact",
    "home": "Home",
    "read_more": "Read More",
    "my_work": "My Work",
    "hero_title": "Davi Luis",
    "hero_subtitle": "Full Stack Developer",
    "hero_description": "Building Scalable Web Applications and Intuitive User Experiences",
    "download_resume": "Download Resume",
    "about_me_title": "About Me",
    "about_me_paragraph1": "Hello! I am a full stack developer passionate about creating innovative solutions that truly make a difference. I believe that technology has the power to transform the world, and I am constantly looking for ways to apply my expertise to generate impactful results. What motivates me is seeing my solutions making life easier for users and companies.",
    "about_me_paragraph2": "I have a degree in Systems Analysis and Development and I am currently studying Computer Science. I also have technical courses in Systems Development and Mechatronics, which provided me with a solid foundation to solve complex problems efficiently. With experience in technologies such as React, Vue.js, Node.js, .NET, Express, Next.js, Tailwind, Sequelize, EntityFramework, and Docker, I am prepared to face challenges of any scale, always focusing on tangible and scalable results.",
    "about_me_paragraph3": "I strongly believe in agile practices, teamwork, and the commitment to deliver solutions that meet the client's exact needs. I am the type of professional who not only solves problems but also seeks to optimize and anticipate solutions for the future. Let's talk about how I can add value to your team and help your company achieve extraordinary results.",
    "projects_title": "My Projects",
    "project_wallet_manager_title": "Wallet Manager",
    "project_wallet_manager_description": "Crypto wallet management project, developed with ASP.NET Core on the backend, integrated with major market APIs such as Binance, CoinMarketCap, and Coingecko. Returns values, charts, trends, and purchase and sale insights. The frontend was built with Next.js and styled with Tailwind CSS, using Entity Framework for database management.",
    "project_visitor_control_title": "Visitor Control",
    "project_visitor_control_description": "Monolithic system for visitor management, developed with Express and EJS. It has JWT authentication, data storage in Firebird for legacy systems, and uses Sequelize with SQLite to save dynamic information, image processing, and integration with facial recognition equipment APIs for registration and access validation.",
    "project_license_plate_title": "License Plate Processing and Access Control System",
    "project_license_plate_description": "System integrated with license plate recognition cameras (LPR) for identification and access control. Allows registration of plates on devices, management of parking spaces, and integration with a legacy system. Uses Firebird for operations in the legacy system and SQLite as the main database.",
    "skill_react_description": "A JavaScript library for building user interfaces. I've been using it since 2022, mainly as a base for Next.js.",
    "skill_node_description": "A backend platform I've been using since 2021, focusing on the Express framework for building robust APIs.",
    "skill_dotnet_description": "A framework for robust and scalable applications. My favorite language for APIs, where I learned the pillars of OOP. I've been using it since 2018.",
    "skill_docker_description": "A tool for creating, managing, and deploying containers. I use it in projects for CI/CD and consistent development environments.",
    "skill_postgresql_description": "An advanced open-source relational database. My favorite for large projects due to its scalability and reliability.",
    "skill_sqlite_description": "A lightweight embedded relational database. My favorite for quick and compact projects due to its practicality and speed.",
    "skill_nextjs_description": "A React framework for production and server-side rendering. I've been using it since 2021, but started to delve deeper in 2023.",
    "skill_tailwind_description": "A utility-first CSS framework for rapid styling. I discovered it in 2022, but delved deeper in 2023, along with Next.js.",
    "skill_experience": "Experience",
    "skill_projects": "Projects"
}