{
    "welcome": "Bem-vindo",
    "about": "Sobre",
    "projects": "Projetos",
    "contact": "Contato",
    "home": "Início",
    "read_more": "Leia Mais",
    "my_work": "Meu Trabalho",
    "hero_title": "Davi Luis",
    "hero_subtitle": "Desenvolvedor Full Stack",
    "hero_description": "Construindo Aplicações Web Escaláveis e Experiências de Usuário Intuitivas",
    "download_resume": "Baixar Currículo",
    "about_me_title": "Sobre Mim",
    "about_me_paragraph1": "Olá! Sou um desenvolvedor full stack apaixonado por criar soluções inovadoras que realmente fazem a diferença. Acredito que a tecnologia tem o poder de transformar o mundo, e estou constantemente procurando maneiras de aplicar minha expertise para gerar resultados impactantes. O que me motiva é ver minhas soluções facilitando a vida de usuários e empresas.",
    "about_me_paragraph2": "Tenho formação em Análise e Desenvolvimento de Sistemas e atualmente estou estudando Ciência da Computação. Também tenho cursos técnicos em Desenvolvimento de Sistemas e Mecatrônica, que me proporcionaram uma base sólida para resolver problemas complexos de forma eficiente. Com experiência em tecnologias como React, Vue.js, Node.js, .NET, Express, Next.js, Tailwind, Sequelize, EntityFramework e Docker, estou preparado para enfrentar desafios de qualquer escala, sempre focando em resultados tangíveis e escaláveis.",
    "about_me_paragraph3": "Acredito fortemente em práticas ágeis, trabalho em equipe e no compromisso de entregar soluções que atendam exatamente às necessidades do cliente. Sou o tipo de profissional que não apenas resolve problemas, mas também busca otimizar e antecipar soluções para o futuro. Vamos conversar sobre como posso agregar valor à sua equipe e ajudar sua empresa a alcançar resultados extraordinários.",
    "projects_title": "Meus Projetos",
    "project_wallet_manager_title": "Gerenciador Cripto",
    "project_wallet_manager_description": "Projeto de gerenciamento de carteiras de criptomoedas, desenvolvido com ASP.NET Core no backend, integrado com as principais APIs do mercado, como Binance, CoinMarketCap e Coingecko. Retorna valores, gráficos, tendências e insights de compra e venda. O frontend foi construído com Next.js e estilizado com Tailwind CSS, usando Entity Framework para gerenciamento de banco de dados.",
    "project_visitor_control_title": "Controle de Visitantes",
    "project_visitor_control_description": "Sistema monolítico para gerenciamento de visitantes, desenvolvido com Express e EJS. Possui autenticação JWT, armazenamento de dados em Firebird para sistemas legados e usa Sequelize com SQLite para salvar informações dinâmicas, processamento de imagens e integração com APIs de equipamentos de reconhecimento facial para registro e validação de acesso.",
    "project_license_plate_title": "Sistema de Processamento de Placas e Controle de Acesso",
    "project_license_plate_description": "Sistema integrado com câmeras de reconhecimento de placas (LPR) para identificação e controle de acesso. Permite o registro de placas em dispositivos, gerenciamento de vagas de estacionamento e integração com um sistema legado. Usa Firebird para operações no sistema legado e SQLite como banco de dados principal.",
    "skill_react_description": "Uma biblioteca JavaScript para construir interfaces de usuário. Eu a uso desde 2022, principalmente como base para o Next.js.",
    "skill_node_description": "Uma plataforma backend que uso desde 2021, focando no framework Express para construir APIs robustas.",
    "skill_dotnet_description": "Um framework para aplicações robustas e escaláveis. Minha linguagem favorita para APIs, onde aprendi os pilares da POO. Eu a uso desde 2018.",
    "skill_docker_description": "Uma ferramenta para criar, gerenciar e implantar contêineres. Eu a uso em projetos para CI/CD e ambientes de desenvolvimento consistentes.",
    "skill_postgresql_description": "Um banco de dados relacional avançado e de código aberto. Meu favorito para grandes projetos devido à sua escalabilidade e confiabilidade.",
    "skill_sqlite_description": "Um banco de dados relacional leve e embutido. Meu favorito para projetos rápidos e compactos devido à sua praticidade e velocidade.",
    "skill_nextjs_description": "Um framework React para produção e renderização do lado do servidor. Eu o uso desde 2021, mas comecei a me aprofundar em 2023.",
    "skill_tailwind_description": "Um framework CSS utilitário para estilização rápida. Eu o descobri em 2022, mas me aprofundei em 2023, junto com o Next.js.",
    "skill_experience": "Experiência",
    "skill_projects": "Projetos"
}